In [1]:
import numpy as np
import pandas as pd

creation of DataFrames using dict

In [3]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

create a dataframe using list

In [5]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
columns=['Name','age','City','Salary']
pd.DataFrame(data_list,columns=columns)

    Name  age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

selection of column

In [6]:
df["Name"]

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [7]:
df[["Name","City"]]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

create a new column

In [8]:
df["designation"] = ["doc","engineer","gynac","coder"]
df

    Name  Age      City  Salary designation
0   John   28  New York   65000         doc
1   Anna   34     Paris   70000    engineer
2  Peter   29    Berlin   62000       gynac
3  Linda   42    London   85000       coder

drop a column

In [16]:
df.drop(["designation","Salary"] , axis=1 ,inplace=True)

In [17]:
df

    Name  Age      City
0   John   28  New York
1   Anna   34     Paris
2  Peter   29    Berlin
3  Linda   42    London

drop a row

In [18]:
df.drop(0,axis=0,inplace=True)
df

    Name  Age    City
1   Anna   34   Paris
2  Peter   29  Berlin
3  Linda   42  London

Selection of rows

In [22]:
df.loc[1]

Name     Anna
Age        34
City    Paris
Name: 1, dtype: object

In [24]:
df.loc[[1,2]]

    Name  Age    City
1   Anna   34   Paris
2  Peter   29  Berlin

In [23]:
df.iloc[0]

Name     Anna
Age        34
City    Paris
Name: 1, dtype: object

slicing rows and cols

In [26]:
df.loc[[1,2]][["Name","City"]]

    Name    City
1   Anna   Paris
2  Peter  Berlin

In [28]:
df.loc[[1,2,3]][["Name","City"]]

    Name    City
1   Anna   Paris
2  Peter  Berlin
3  Linda  London

conditional selection

In [29]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [31]:
#see elements above age is 30 
df[df["Age"] > 30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [ ]:
#age above 30 and city must be paris